import re

# 招商银行：    支付    扣款    人民币XXX
zs = [
    "您账户6483于02月13日14:58在【京东支付-肯特瑞小金库网银平台】发生快捷支付扣款，人民币2020.00[招商银行]",
    "您账户6483于01月30日20:11银联扣款人民币100.00元（梦幻西游藏宝阁）[招商银行]",
    "您的招商银行储蓄卡6483于01月16日16:21，在航班管家一网通支付人民币240.00元，订单号GTD303P2001616203695407516。[招商银行]",
    "您的工商银行储蓄卡8518于06月28日13:46，在以为一网通支付人民币0.01元，已优惠1.99元，订单号1561700759249852190628134558。[招商银行]",
    "您账户1523于10月03日21:05直付通/快捷支付扣款人民币99.50，余额1123.59[招商银行] "
]

# 建设银行：    支出    人民币XXX
js = [
    "您尾号0456的储蓄卡账户2月20日22时24分消费支出人民币1.00元,活期余额7146.86元。[建设银行]",
    "您尾号的储蓄卡账户2月23日23时6分银联在线支付支出人民币6.00元,活期余额 元。[建设银行]",
    "您尾号3175的储蓄卡账户6月1日12时9分27秒短信服务费支出人民币3.00元,活期余额10.02元。[建设银行]",
    "您尾号8199的储蓄卡账户11月5日16时1分ATM取款支出人民币300.00元,活期余额71.16元。[建设银行]"
]

# 工商银行、工行信使:     支出    XXX元
gs = [
    "您尾号5309卡10日14:48POS支出（消费）136.49元，圈存100元人民币。【工商银行】",
    "工行信使：您的尾号为5588的牡丹灵通卡18日15:00POS支出（消费）500.00元。如有疑问，请致电95588",
]

# 中国银行:     支取    人民币XXX元
zg = [
    "您借记卡账户 于1025POS支取人民币10.00元,交易后余额553.92【中国银行】",
    "您账户****,于1004支取(话费)人民币20.00元,交易后余额****【中国银行】",
    "您的个人账户8888于2014-07-31 10:09:50 网银支取人民币8888.00元，交易后余额123.00元【中国银行】 "
]

# 光大银行：    支出
gd = [
    "尾号6469账户11:56支出32.34元，余额88.74元，摘要:网上支付 支付宝 支付宝[光大银行]"
]

# 平安银行：    取      RMBXXX元
pa = [
    # "11月03日09时51分,账户*[9002]取RMB3,700.00元成功，现余额6,749.68元【平安银行】"
]

# 农业银行：    支      XXX元
ny = [
    # "【四川农行】您好:您的账户6228***1813于20141012现支(分行营业部)-1400.00元,余额498.58元"
]

# 民生银行：    支出    XXX元
ms = [
    "账户*8844于11月04日08:13支出￥100.00元，可用余额9800.00元。取款:86310138成都市红星中路四段199号蜀源大厦。【民生银行】"
]

errs = [
    "您账户1523于11月01日21:23ATM存款人民币8000.00，余额8402.39[招商银行] ",
    "xx向您尾号6469账户15:24转入8000元，余额为8654.78元，摘要:网银跨行汇款。[光大银行] ",
    "您尾号8199的储蓄卡账户10月26日14时3分ATM存款收入人民币2786.07元,活期余额3443.16元。[建设银行]",
    "【成都银行】您尾号为2352的卡于10月7日16时57分行内ATM存款人民币1,500元。公交次卡、电卡充值，我行营业点一站搞定",
    "10月30日11时03分,账户*[9002]存RMB485,000.00元成功，现余额561,752.68元【平安银行】"
]


def parser(msg:str) -> (str, float):
    """
    Args:
        msg: 短信内容
    Returns:
        银行名称:str
        金额:float
    """
    import re
    if not any( [op in msg for op in ["支付","支出","支取","扣款"]] ):
        # 非支付后余额变动短信
        return "", -1
    
    # 获得银行名称
    res1 = re.findall(r"[【\[](\w+行)[\]】]", msg)
    if res1 :
        bank = res1[0]
    elif "工行" in msg:
        bank = "工商银行"
    else:
        # 非法
        return "", -1
    bank = "农业银行" if "农行" in bank else bank

    # 获得金额
    res2 = re.findall(r"((?:\d\,?)+\.\d{2})", msg)
    if not res2:
        return "", -1
    amount = res2[0]

    return bank, amount



if __name__ == "__main__":
    msgs = zs+js+gs+zg+gd+pa+ny+ms+errs
    for msg in msgs:
        print(msg)
        print(parser(msg))
    # print(gs[1])
    # print( re.findall(r"((?:\d\,?)+\.\d{2})", gs[1]) )
    # print( parser(gs[0]))
    # m = re.findall(r"[【\[](\w+行)[\]】].*[支|取|扣款]\w*((?:\d\,?)+)\.\d{2}","【四川农行】您好:您的账户6228***1813于20141012现支(分行营业部)-1400.00元,余额498.58元")
    # "[支付|支出|支取|扣款]"

